{"_default": {"1": {"author": "therightman", "publish_date": "2015-12-20", "text": "Hello Everyone!\n\nI'm very happy to announce the launch of our website!\n\nYou can now join the DevChannel by filling up the form in the \"Join\" section of the website and of course send your friends here if they want to join too :)\n\nIf you take a look around here you'll probably notice that this is not finished.. At all. Any suggestions will be appreciated, and you can make them by joining our chat (again, in the \"Join\" section) and contact me (therightman), another administrator, or just share it publicly.\n\nThanks for tuning in, see you in the chat ;)"}, "2": {"author": "therightman", "publish_date": "", "text": "Weekly challenge #3:\n\nMake a todo-bot (a todo-list with which you interact with commands like \"add 'make a robot' to bigProjects\").\n\nThe goal is pretty obvious, you should have the current functionalities:\n* Adding new items\n* Marking items as done\n* Check the list of stuff you still have to do and also the list of completed tasks\n\nExample: Given the command \"add 'change player skin'\" would add 'change player skin' to the list and \"'change player skin' done\" would move it to a 'Done' list\n\nYou can improve it and simplify it as much as you want by adding functionalities like having multiple lists, reminders, etc...\n\nrules are that you should make it in teams of 2-3 people.\n\nThe final projects will be ranked and the best (or maybe a combination of the best) will be integrated by us to the slack chat as bot!\n\nIf you want to participate, find 1 or 2 people to team with and start working on it, you can ask me, @daruso , @vaggelisd or @himrin to make you a private channel :) Finally, the submission date is until next Sunday(March 6th) at midnight, you should upload it to a github repo and link us to it in this channel(#weekly_callenge) :D\n\nGood luck!"}, "3": {"author": "therightman", "publish_date": "", "text": "Biweekly challenge #1 (UPDATED)\n\nHey there! This time the goal will be to create an autocorrect program.\n\nThe basic task is to write an autocorrect program.\n\nIt should be able to test if a typed word is correct or not and give some feedback to the user.\n\nImprove it as much as you want (graphical interface, analyzing sentences, predicting mistakes... do what you feel that is right, be creative!\n\nIf you use a list of words please put it in a file called 'words.txt', and you can use our list!\n\nTHIS CHALLENGE IS FOR EVERYONE. Don't be afraid to participate if you know your program will lose, what matters is what you learn :D\n\nFIND A PARTNER or do it on your own, but teams (2-3 people) will have bonus points for cooperation!\n\nDeadline: Sunday, March 20th at mid night (GMT 0) (beginning of Monday :) ) Good luck!"}, "4": {"author": "therightman", "publish_date": "", "text": "Biweekly challenge #2 (UPDATED)\n\nHello everyone, I'm here to announce the second biweekly challenge!\n\nThis week it will be to make a Web App. The goal is to have a file uploader: you choose a file from your pc, upload and it gets stored in the server.\n\nThe most basic version of this would be being able to upload text files. After that, display/reproduce the files on the website.\n\nSome improvements would be:\n\n* more file types\n* drag and drop feature\n* make a better design for the website\n* add restrictions such as file size\n* maximum number of requests\n* etc, the best you can do, try to make it as visible as possible\n\nYou are encouraged to make it with teams, and those that do will get extra points for it\n\nGood luck!"}, "5": {"author": "therightman", "publish_date": "2016-04-15", "text": "Biweekly challenge #3\n\nWe're sorry for the delay on the release of this challenge, we have generally been busy and this is a week and 3 days late.\n\nThe challenge:\n\nMake a photo viewer (desktop or Web app) that allows the user to view a slideshow of images. The application should load the images from a directory specified in the code.\n\nBonus points for the following:\n\n* Allow the user to select an image directory\n* Various types of transition between images\n* Anything else that you might find interesting\n\nDeadline: End of Friday April 22nd (your local time)"}, "6": {"author": "therightman", "publish_date": "2016-05-20", "text": "For this challenge we would like for you to create one of two things based on whether you're developing for web or a desktop application.\n\nBoth projects will have you building a backup application.\n\n* For desktop The user should be able to plug in a USB storage device and select a folder to have that entire folder backed up to the storage device.\n* For web we'll be using the same concept but it should back a folder up to a remote file system. For our purposes the folder can be copied to another location on the same machine through the web app.\n\nThis challenge will conclude on June 3rd at midnight your local time.\n\nWe will be reviewing the entries on June 4th."}, "7": {"author": "therightman", "publish_date": "2016-05-28", "text": "CTF TEAM- RenegadePwners\n\nMembers:\n\n* dir_illista\n* renegadeuser\n* Ben CU\n* 6uru0fSh1Va aka 6uRusC0d3\n\nCTF Practise 1- https://backdoor.sdslabs.co/challenges/2013-BIN-50\n\nTime: 1PM PST/4PM EST\n\nSIGN UP AT: https://backdoor.sdslabs.co/signin\n\nDiscord invite - https://discordapp.com/invite/0tXonQPTZnAEfmwC"}}}
